// See https://aka.ms/new-console-template for more information
//Задача 23

//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
int N = Convert.ToInt32(Console.ReadLine());
for (int i = 1;  i < N+1;  i++)
{
  double a = Math.Pow(i, 3);



{
  Console.WriteLine (a); 
} 
}  
 


